DO-2023/Meta 2.2/meta.tex
% Created 2023-09-21 jue 20:50
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{../modern}
\raggedbottom
\setcounter{secnumdepth}{2}
\author{Luis Eduardo Galidno Amaya}
\date{21 de Septiembre 2023}
\title{Meta 2.1 - Evaluación del desempeño, trabajo en equipo, capacitación}
\hypersetup{
 pdfauthor={Luis Eduardo Galidno Amaya},
 pdftitle={Meta 2.1 - Evaluación del desempeño, trabajo en equipo, capacitación},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.3)}, 
 pdflang={Spanish}}
\begin{document}

\modentitlepage{../images/escudo-uabc-2022-1-tinta-pos.png}
\datasection{Individual}

\section{Ensayo}
\label{sec:orgf9fcc46}
Diferentes tipos de trabajos requieren diferentes tipos de organizaciones entre sus miembros, en el texto conocí algunas de las principales formas de organizar como se integra un equipo: autocrático, burocrático, coaching, democrático, laissez-faire,  pacesetter y visionario, y como diferentes maneras de organizarse pueden fomentar que el trabajo se distribuya de manera mas eficiente entre los integrantes permitiendo así incrementar su eficiencia.\\

Investigando un poco mas sobre los estilos de organización pude notar como mientras la metas son mas definidas los estilos que permiten una mayor eficiencia son los mas autoritarios mientras que los estilos mas horizontales eran mas efectivos. \\

La elección de el estilo de liderazgo dependerá de la situación y las necesidades, un líder efectivo sabrá cuando aplicar diferentes estilos de liderazgo según la situación, la flexibilidad es un clave para el exito. \\

Como ingenieros en software estamos en un entorno en constante cambio donde en objetivo puede variar, una organización que permita flexibilidad con los miembros del equipo y el fomento a nuevas ideas permitirá ofrecer un software de mayor valor para el stackeholder.
\end{document}
